Revit 2027 API
BuiltInFailures.AlignmentFailures.AlignmentCheckStationLabels Property
 A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels. Please check the labels to ensure proper placement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AlignmentCheckStationLabels { get; }
Public Shared ReadOnly Property AlignmentCheckStationLabels As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AlignmentCheckStationLabels {
	FailureDefinitionId^ get ();
}
static member AlignmentCheckStationLabels : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AlignmentFailures Class
Autodesk.Revit.DB Namespace